tutorials/incompressible/MRFSimpleFoam/axialTurbine_mixingPlane/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // For meshes with
    // disparities in angle span across the mixingPlane interface, a
    // solver for asymmetrical matrices is required, like BiCGStab. When
    // in doubt, just select a solver for asymmetrical matrices for p.
    p
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.05;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
}

// ************************************************************************* //
